ShellAlbert/DCMotorx1_StepperMotorx2/STM32F103VET6APP/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
//TIM1: CH1,CH1N used to drive DC motor(drv8848).
//72MHz/Prescale=72MHz/2=36MHz
//ARR(AutoReloadRegister)=360,36KHz/360=100KHz.
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f1xx_hal_uart.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/**********************************************************/
//TIM1-CH1/CH1N: output PWM to drive DC motor.
//TIM5-CH1/CH1N: DC motor encoder A/B phase input.
/**********************************************************/
//TIM2-CH1/CH1N: output PWMto drive Stepper Left/Right motor.
//TIM3: used to help to stop TIM2-CH1.
/**********************************************************/
//TIM8-CH2: output PWM to drive Stepper Up/Down motor.
//TIM4: used to help to stop TIM8-CH2.
/**********************************************************/

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_rx;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = { .name = "defaultTask",
		.priority = (osPriority_t) osPriorityNormal, .stack_size = 128 };
/* Definitions for ZPidTask */
osThreadId_t ZPidTaskHandle;
const osThreadAttr_t ZPidTask_attributes = { .name = "ZPidTask", .priority =
		(osPriority_t) osPriorityRealtime, .stack_size = 256 };
/* Definitions for ZModBusTask */
osThreadId_t ZModBusTaskHandle;
const osThreadAttr_t ZModBusTask_attributes = { .name = "ZModBusTask",
		.priority = (osPriority_t) osPriorityRealtime, .stack_size = 256 };
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
void StartDefaultTask(void *argument);
void ZPidTaskLoop(void *argument);
void ZModBusTaskLoop(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#include <string.h>
#include <math.h>
uint32_t g_CRC32JAMCRCCalculate(uint8_t *s, int len);

//the flag.
uint8_t g_flagDCMotorPeakCurrent = 0;

//each command is 24 bytes at least.
//Sync(4)+Length(4)+Key(4)+Address(4)+Data(4)+Padding(0)+CRC32(4)
#define CMD_LENGTH_MIN	24
uint8_t g_Uart1DmaBuffer[CMD_LENGTH_MIN];

#define CMD_POLL_SIZE	(CMD_LENGTH_MIN*50)
uint8_t g_Uart1DmaPoll[CMD_POLL_SIZE];
uint32_t g_Uart1DmaPollLength = 0;

//the flag.
uint8_t g_FlagUart1GetNewData = 0;
typedef enum {
	UnPack_Sync_Filed = 0,
	UnPack_Length_Field,
	UnPack_Key_Field,
	UnPack_Address_Field,
	UnPack_Data_Field,
	UnPack_Padding_Field,
	UnPack_CRC32_Field,
} ZModBusUnPackFSM;
typedef struct {
	ZModBusUnPackFSM m_fsm;
	uint8_t m_flagEncrypt;
	uint8_t m_length;
	uint32_t m_key;
	uint32_t m_address;
	uint32_t m_data;
	uint32_t m_crc32;
	uint8_t m_crc32Buffer[CMD_LENGTH_MIN];
	uint8_t m_crc32BufferLen;

	//DC motor & encoder related.
	uint32_t m_uTargetEncoder;
	float maxOut;
	float inteLimit;
	float inputMaxErr;

	float kP;
	float kI;
	float kD;

	float setV;
	float getV;

	float err;
	float last_err;

	float pOut;
	float iOut;
	float dOut;
	float out;
	//other ModBus related variables.
	uint32_t m_uBatteryPercent;
	uint32_t m_uRSSIPercent;
	uint32_t m_uDistance;
	uint32_t m_uOutputVol;
	uint32_t m_uVideoCtl;
	uint32_t m_uFPGAReg;
	uint32_t m_uCrossXY;
} ZModBusObject;

ZModBusObject modbusObj;
enum {
	nReg_Battery_R = 0x000001,						//read battery register.
	nReg_RSSI_R = 0x000002, 						//read RSSI register.
	nReg_Distance_R = 0x000003, 					//read Distance register.
	nReg_LenMotorCtl_W = 0x800004,				//write LenMotorCtl register.
	nReg_2DBracketCtl_W = 0x800005, 		//write 2D bracket ctrl register.
	nReg_OutVolume_R = 0x000006,				//read output volume register.
	nReg_OutVolume_W = 0x800006,				//write output volume register.
	nReg_VideoCtl_R = 0x000007, 					//read videoCtl register.
	nReg_VideoCtl_W = 0x800007, 					//write videoCtl register.
	nReg_FPGA_R = 0x000008, 						//read FPGA register.
	nReg_FPGA_W = 0x800008, 						//write FPGA register.
	nReg_CrossXY_R = 0x000009,						//read CrossXY register.
	nReg_CrossXY_W = 0x800009,						//write CrossXY register.
	nReg_AutoFocus1_R = 0x3F0000,					//read AutoFocus1 register.
	nReg_AutoFocus1_W = 0xBF0000,					//write AutoFocus1 register.
};
#define MODBUS_ADDR_ME			(0x01<<24) //0x01000000
#define MODBUS_ADDR_APP			(0xFF<<24) //0xFF000000
#define MODBUS_ADDR_BROADCAST	(0x00<<24) //0x00000000

//ADC1-CHannel10:	BatteryVoltage
//ADC1-Channel12: 	RSSI
uint16_t g_ADC1DMABuffer[30][2];

//when the current of DC motor gets to grow
//this interrupt occurs,stop PWM output.
void HAL_ADC_LevelOutOfWindowCallback(ADC_HandleTypeDef *hadc) {
	static uint32_t nDCPeakCurrentCnt = 0;
	if (hadc->Instance == ADC2) {
		if (__HAL_ADC_GET_FLAG(hadc, ADC_FLAG_AWD) != RESET) {
			if ((g_flagDCMotorPeakCurrent == 0)
					&& (nDCPeakCurrentCnt++ >= 100)) {
				nDCPeakCurrentCnt = 0;
				//			HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
				//			HAL_TIMEx_PWMN_Stop(&htim1, TIM_CHANNEL_1);
				//			HAL_GPIO_WritePin(NSLEEP_GPIO_Port, NSLEEP_Pin, GPIO_PIN_RESET);

				//>50%:clockwise,<50%:anti-clockwise,=50%:stop.
				//CCR/ARR=180/360=50%.
				__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 180);

