ShellAlbert/DCMotorx1_StepperMotorx2/STM32F103VET6APP/Core/Src/main.c
				//reset encoder to 0.
				//here we do not set to 0,because it reaches the boundary.
				//0-1=65535 or 65535+1=0.
				//so here we use 500 as the ZeroPoint encoder value.
				__HAL_TIM_SET_COUNTER(&htim5, 500);

				//reset flag.
				g_flagDCMotorPeakCurrent = 1;
			}
		}
	}
}
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == USART1) {
		//HAL_UART_Transmit(&huart1,g_UART1DMABuffer,CMD_LENGTH_MIN,100);
		if (g_Uart1DmaPollLength + CMD_LENGTH_MIN < CMD_POLL_SIZE) {
			memcpy(&g_Uart1DmaPoll[g_Uart1DmaPollLength], g_Uart1DmaBuffer,
					CMD_LENGTH_MIN);
			g_Uart1DmaPollLength += CMD_LENGTH_MIN;
			g_FlagUart1GetNewData = 1;
		}
	}
}
uint32_t zsyHtonl(uint32_t uData) {
	uint32_t uByteConverted;
	uint8_t *p = (uint8_t*) &uByteConverted;
	p[0] = (uData >> 24) & 0xFF;
	p[1] = (uData >> 16) & 0xFF;
	p[2] = (uData >> 8) & 0xFF;
	p[3] = (uData >> 0) & 0xFF;
	return uByteConverted;
}
void zsyTxResponse(uint32_t regAddr, uint32_t regData) {
	uint32_t uResponse[6];
	uResponse[0] = zsyHtonl(0x44454354);				//sync.
	uResponse[1] = zsyHtonl(16);				//length.
	uResponse[2] = 0;				//key.
	uResponse[3] = zsyHtonl(regAddr | MODBUS_ADDR_APP);				//address.
	uResponse[4] = zsyHtonl(regData);				//key.
	uResponse[5] = g_CRC32JAMCRCCalculate((uint8_t*) uResponse, 20);	//CRC32.

	HAL_UART_Transmit(&huart1, (uint8_t*) uResponse, sizeof(uResponse), 1000);
}
void zsyParseModBusFrame(ZModBusObject *obj) {
	if (obj->m_flagEncrypt) {
		//do not support encrypted frame in this version.
		return;
	}
	//1.check address is not mine or not broadcast address.
	if (!(((obj->m_address & 0xFF000000) == MODBUS_ADDR_ME)
			|| ((obj->m_address & 0xFF000000) == 0))) {
		//do not response any.
		return;
	}
	switch (obj->m_address & 0x00FFFFFF) {
	case nReg_Battery_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 01 00 00 00 01 5C 9C 78 76
		zsyTxResponse(nReg_Battery_R, obj->m_uBatteryPercent);
		break;
	case nReg_RSSI_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 02 00 00 00 01 1B 3C 02 A6
		zsyTxResponse(nReg_RSSI_R, obj->m_uRSSIPercent);
		break;
	case nReg_Distance_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 03 00 00 00 01 26 5C 2B 16
		zsyTxResponse(nReg_RSSI_R, obj->m_uDistance);
		break;
	case nReg_LenMotorCtl_W: {
		uint8_t uWhichMotor = (obj->m_data >> 24) & 0xFF;
		uint8_t uMotorAction = (obj->m_data >> 16) & 0xFF;
		uint16_t uMotorIncrease = 1800;
		switch (uWhichMotor) {
		case 0x1:				//left motor.
			if (uMotorAction == 0x1)				//clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 04 01 01 00 01 5A EB EF 5A
				(obj->m_uTargetEncoder) += uMotorIncrease;
			} else if (uMotorAction == 0x2)				//anti-clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 04 01 02 00 01 58 AD 51 01
				(obj->m_uTargetEncoder) -= uMotorIncrease;
			}
			break;
		case 0x2:				//right motor.
			break;
		case 0xFF:				//all motors.
			break;
		default:
			break;
		}
		//CAUTION!!! here to prevent encoder value to overflow.
		//0-1=65535    65535+1=0
		if (obj->m_uTargetEncoder < 180) {
			obj->m_uTargetEncoder = 180;
		} else if (obj->m_uTargetEncoder >= 65535) {
			obj->m_uTargetEncoder = 65535;
		}
		zsyTxResponse(nReg_LenMotorCtl_W, obj->m_data);
	}
		break;
	case nReg_2DBracketCtl_W: {
		uint8_t uWhichMotor = (obj->m_data >> 24) & 0xFF;
		uint8_t uMotorAction = (obj->m_data >> 16) & 0xFF;
		uint16_t uMotorIncrease = 500;
		switch (uWhichMotor) {
		case 0x1:		//Up/Down direction motor.
			if (uMotorAction == 0x1)		//clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 05 01 01 00 01 67 8B C6 EA
				HAL_GPIO_WritePin(SM_UpDown_NSLEEP_GPIO_Port,
						SM_UpDown_NSLEEP_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(SM_UpDown_DIR_GPIO_Port, SM_UpDown_DIR_Pin,
						GPIO_PIN_RESET);
				HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_2);
				HAL_TIM_Base_Start_IT(&htim3);
			} else if (uMotorAction == 0x2)		//anti-clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 05 01 02 00 01 65 CD 78 B1
				HAL_GPIO_WritePin(SM_UpDown_NSLEEP_GPIO_Port,
						SM_UpDown_NSLEEP_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(SM_UpDown_DIR_GPIO_Port, SM_UpDown_DIR_Pin,
						GPIO_PIN_SET);
				HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_2);
				HAL_TIM_Base_Start_IT(&htim3);
			}
			break;
		case 0x2:		//Left/Right direction motor.
			if (uMotorAction == 0x1)		//clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 05 02 01 00 01 75 3E 69 08
				HAL_GPIO_WritePin(SM_LeftRight_NSLEEP_GPIO_Port,
						SM_LeftRight_NSLEEP_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(SM_LeftRight_DIR_GPIO_Port,
						SM_LeftRight_DIR_Pin, GPIO_PIN_RESET);
				HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
				HAL_TIM_Base_Start_IT(&htim4);
			} else if (uMotorAction == 0x2)		//anti-clockwise.
					{
				//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 05 02 02 00 01 77 78 D7 5F
				HAL_GPIO_WritePin(SM_LeftRight_NSLEEP_GPIO_Port,
						SM_LeftRight_NSLEEP_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(SM_LeftRight_DIR_GPIO_Port,
						SM_LeftRight_DIR_Pin, GPIO_PIN_SET);
				HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
				HAL_TIM_Base_Start_IT(&htim4);
			}
			break;
		default:
			break;
		}
		zsyTxResponse(nReg_2DBracketCtl_W, obj->m_data);
	}
		break;
	case nReg_OutVolume_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 06 00 00 00 01 11 43 5b 9a
		zsyTxResponse(nReg_OutVolume_R, obj->m_uOutputVol);
		break;
	case nReg_OutVolume_W:
		////44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 06 00 00 00 32 11 43 5b 9a
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	case nReg_VideoCtl_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 07 00 00 00 01 2C 23 72 2A
		zsyTxResponse(nReg_OutVolume_W, obj->m_uVideoCtl);
		break;
	case nReg_VideoCtl_W:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 07 00 00 00 02 3d 3c c9 62
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	case nReg_FPGA_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 08 00 00 00 01 51 8C 1A 07
		zsyTxResponse(nReg_OutVolume_W, obj->m_uFPGAReg);
		break;
	case nReg_FPGA_W:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 08 00 00 00 02 51 8C 1A 07
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	case nReg_CrossXY_R:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 00 00 09 01 23 04 56 7F 38 AD 38
		zsyTxResponse(nReg_OutVolume_W, obj->m_uCrossXY);
		break;
	case nReg_CrossXY_W:
		//44 45 43 54 00 00 00 10 00 00 00 00 01 80 00 09 01 23 04 56 08 D1 B8 36
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	case nReg_AutoFocus1_R:
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	case nReg_AutoFocus1_W:
		zsyTxResponse(nReg_OutVolume_W, obj->m_data);
		break;
	default:
		break;
	}
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

