ShellAlbert/DCMotorx1_StepperMotorx2/STM32F103VET6APP/Core/Src/main.c
	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_USART1_UART_Init();
	MX_TIM4_Init();
	MX_ADC1_Init();
	MX_ADC2_Init();
	MX_TIM1_Init();
	MX_TIM8_Init();
	MX_TIM2_Init();
	MX_TIM3_Init();
	MX_TIM5_Init();
	/* USER CODE BEGIN 2 */

	//zsy:start TIM1-CH1/CH1N to driver DC motor.
	//zsy:DC motor to get ZeroPoint through Peak Current at startup.
	HAL_GPIO_WritePin(NSLEEP_GPIO_Port, NSLEEP_Pin, GPIO_PIN_SET);
	//>50%:clockwise,<50%:anti-clockwise,=50%:stop.
	//CCR/ARR=180/360=50%.
	//set Duty Cycle to 0% to get the maximum speed.
	//__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,0);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_1);

	//zsy:start encoder.
	HAL_TIM_Encoder_Start(&htim5, TIM_CHANNEL_1);
	HAL_TIM_Encoder_Start(&htim5, TIM_CHANNEL_2);

	//delay 100ms to bypass the DC motor startup peak current.
	//if here less than 100ms, the DC motor maybe cannot startup.
	//when it startup,peak current ADC IRQ trigger immediately.
	//so keep it more than 100ms.
	HAL_Delay(100);

	//zsy:start ADC.
	HAL_ADCEx_Calibration_Start(&hadc1);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*) g_ADC1DMABuffer, 30 * 2);
	HAL_ADC_Start(&hadc2);

	//zsy:nSLEEP=0 to save power.
	HAL_GPIO_WritePin(SM_UpDown_NSLEEP_GPIO_Port, SM_UpDown_NSLEEP_Pin,
			GPIO_PIN_RESET);
#if 0
	//zsy:stepper motor for up/down direction.
	HAL_GPIO_WritePin(SM_UpDown_NSLEEP_GPIO_Port, SM_UpDown_NSLEEP_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(SM_UpDown_DIR_GPIO_Port, SM_UpDown_DIR_Pin, GPIO_PIN_RESET);
	HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_2);
	HAL_TIM_Base_Start_IT(&htim4);
#endif

	HAL_GPIO_WritePin(SM_LeftRight_NSLEEP_GPIO_Port, SM_LeftRight_NSLEEP_Pin,
			GPIO_PIN_SET);
#if 0
	//zsy:stepper motor left/right direction.
	HAL_GPIO_WritePin(SM_LeftRight_NSLEEP_GPIO_Port, SM_LeftRight_NSLEEP_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(SM_LeftRight_DIR_GPIO_Port, SM_LeftRight_DIR_Pin, GPIO_PIN_RESET);
	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
	HAL_TIM_Base_Start_IT(&htim3);
#endif

	//zsy:uart1 receive with DMA.
	HAL_UART_Receive_DMA(&huart1, g_Uart1DmaBuffer, CMD_LENGTH_MIN);

	//zsy:modbus protocol.
	modbusObj.m_fsm = UnPack_Sync_Filed;
	modbusObj.m_uBatteryPercent = 0;
	modbusObj.m_uRSSIPercent = 0;
	modbusObj.m_uDistance = 0;
	modbusObj.m_uOutputVol = 0;
	modbusObj.m_uVideoCtl = 0;
	modbusObj.m_uFPGAReg = 0;
	modbusObj.m_uCrossXY = 0;

	//if this initial value is 0,it may cause error.
	//here we do not set to 0,because it reaches the boundary.
	//0-1=65535 or 65535+1=0.
	//so here we use 500 as the ZeroPoint encoder value.
	modbusObj.m_uTargetEncoder = 500;

#if 0
	while(1)
	{
		//do PID after reached ZeroPoint.
		if(g_flagDCMotorPeakCurrent)
		{
			float fPIDOut;
			uint32_t uPWMCtl;
			modbusObj.m_uCurrentEncoder=__HAL_TIM_GET_COUNTER(&htim5);
			fPIDOut= zsy_PIDCalculate(&modbusObj);
			uPWMCtl=180-fPIDOut;
			//			char buffer[64];
			//			sprintf(buffer,"%d,%d,%d\n",modbusObj.m_uCurrentEncoder,modbusObj.m_uTargetEncoder,uPWMCtl);
			//			HAL_UART_Transmit(&huart1,buffer,strlen(buffer),100);
			__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,uPWMCtl);
		}

		//do parse out UART1 ModBus protocol.
		if(g_FlagUart1GetNewData)
		{
			uint32_t i=0;
			for(i=0;i<g_Uart1DmaPollLength;i+=4)
			{
				uint32_t t0=g_Uart1DmaPoll[i+0];
				uint32_t t1=g_Uart1DmaPoll[i+1];
				uint32_t t2=g_Uart1DmaPoll[i+2];
				uint32_t t3=g_Uart1DmaPoll[i+3];
				uint32_t uRxData=(t0<<24)|(t1<<16)|(t2<<8)|(t3<<0);
				switch(modbusObj.m_fsm)
				{
				case UnPack_Sync_Filed:
					if(uRxData==0x44454354)
					{
						modbusObj.m_flagEncrypt=0;
						modbusObj.m_fsm=UnPack_Length_Field;
					}if(uRxData==0x454E4354)
					{
						modbusObj.m_flagEncrypt=1;
						modbusObj.m_fsm=UnPack_Length_Field;
					}else{
						//something wrong,bypass this int(4 bytes).
					}
					memcpy(modbusObj.m_crc32Buffer,(void*)&g_Uart1DmaPoll[i],sizeof(uint32_t));
					modbusObj.m_crc32BufferLen=sizeof(uRxData);
					break;
				case UnPack_Length_Field:
					//Sync(4)+Length(4)+Key(4)+Address(4)+Data(4)+Padding(0)+CRC32(4)
					//So Length=Key(4)+Address(4)+Data(4)+Padding(0)+CRC32(4)=16 at least.
					if(uRxData<16)
					{
						modbusObj.m_fsm=UnPack_Sync_Filed;
					}else{
						modbusObj.m_length=uRxData;
						modbusObj.m_fsm=UnPack_Key_Field;
						memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],(void*)&g_Uart1DmaPoll[i],sizeof(uint32_t));
						modbusObj.m_crc32BufferLen+=sizeof(uRxData);
					}
					break;
				case UnPack_Key_Field:
					modbusObj.m_key=uRxData;
					modbusObj.m_fsm=UnPack_Address_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],(void*)&g_Uart1DmaPoll[i],sizeof(uint32_t));
					modbusObj.m_crc32BufferLen+=sizeof(uRxData);
					break;
				case UnPack_Address_Field:
					modbusObj.m_address=uRxData;
					modbusObj.m_fsm=UnPack_Data_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],(void*)&g_Uart1DmaPoll[i],sizeof(uint32_t));
					modbusObj.m_crc32BufferLen+=sizeof(uRxData);
					break;
				case UnPack_Data_Field:
					modbusObj.m_data=uRxData;
					modbusObj.m_fsm=UnPack_CRC32_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],(void*)&g_Uart1DmaPoll[i],sizeof(uint32_t));
					modbusObj.m_crc32BufferLen+=sizeof(uRxData);
					break;
				case UnPack_CRC32_Field:
					modbusObj.m_crc32=uRxData;
					modbusObj.m_fsm=UnPack_Sync_Filed;
					uint32_t uCalcCRC32=g_CRC32JAMCRCCalculate(modbusObj.m_crc32Buffer,modbusObj.m_crc32BufferLen);
					if(modbusObj.m_crc32==uCalcCRC32)
					{
						zsyParseModBusFrame(&modbusObj);
					}
					break;
				default:
					modbusObj.m_fsm=UnPack_Sync_Filed;
					break;
				}
			}

			g_Uart1DmaPollLength=0;
			//reset flag.
			g_FlagUart1GetNewData=0;
			HAL_UART_Receive_DMA(&huart1,g_Uart1DmaBuffer, CMD_LENGTH_MIN);
		}
#if 0
		uint16_t uAverageVal[2];
		for(uint32_t i=0;i<2;i++)
		{
			uint32_t sum=0;
			for(uint32_t j=0;j<30;j++)
			{
				sum+=g_ADC1DMABuffer[j][i];
			}
			uAverageVal[i]=sum/30;

