ShellAlbert/DCMotorx1_StepperMotorx2/STM32F103VET6APP/Core/Src/main.c
uint32_t g_CRC32JAMCRCCalculate(uint8_t *s, int len) {
	int i;
	uint32_t crc32val = 0;

	crc32val ^= 0xFFFFFFFF;

	for (i = 0; i < len; i++) {
		crc32val = g_CRC32Table[(crc32val ^ s[i]) & 0xFF]
				^ ((crc32val >> 8) & 0x00FFFFFF);
	}

	return labs(crc32val ^ 0xFFFFFFFF);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument) {
	/* USER CODE BEGIN 5 */
	/* Infinite loop */
	for (;;) {
		osDelay(1);
	}
	/* USER CODE END 5 */
}

/* USER CODE BEGIN Header_ZPidTaskLoop */
/**
 * @brief Function implementing the ZPidTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_ZPidTaskLoop */
float zsy_PIDCalculate(ZModBusObject *obj, float getV, float setV) {
	float fKp = 1.5;
	float fKi = 0;
	float fKd = 0;

	obj->getV = getV;
	obj->setV = setV;
	obj->err = setV - getV;

	obj->pOut = fKp * obj->err;
	obj->iOut += fKi * obj->err;
	obj->dOut = fKd * (obj->err - obj->last_err);

	obj->out = obj->pOut + obj->iOut + obj->dOut;

	return obj->out;
}
void ZPidTaskLoop(void *argument) {
	/* USER CODE BEGIN ZPidTaskLoop */
	/* Infinite loop */

	ZModBusObject *obj = (ZModBusObject*) argument;

	for (;;) {
		//do PID after reached ZeroPoint.
		if (g_flagDCMotorPeakCurrent) {
			float fPIDOut;
			uint32_t uCurrentEncoder;
			uint32_t uPWMCtl = 0;

			//setup CCR，Duty Cycle=CCR/ARR,>50%:clockwise,<50%:anti-clockwise,=50%:stop.
			//0%:clockwise at maximum speed,100%:anti-clockwise at maximum speed.
			//at initial we set TIM1 ARR=360, so if we want duty cycle equals 50%，then 50%=CCR/ARR -> CCR=180.
			//so here CCR=180-pidOut,this is we expect value.
			//if (target-current) --->>>0 ,180-pidOut--->>>180，now duty cycle--->>>50%,motor stop.
			//   when (target-current) located in (0~180) range:
			//   1.if diff=1,then 180-pidOut=180-1=179,duty cycle=179/360=49.72%
			//   2.if diff=10,then 180-pidOut=180-10=170,duty cycle=170/360=47.22%
			//   3.if diff=160,then 180-pidOut=180-160=20,duty cycle=20/360=5.5%
			//   4.if diff=180,then 180-pidOut=180-180=0,duty cycle=0/360=0% (clockwise maximum speed)

			//if (target-current) located in (-180~0) range:
			//   1.if diff=-1,then 180-pidOut=180-(-1)=181,duty cycle=181/360=50.27%
			//   2.if diff=-10,then 180-pidOut=180-(-10)=190,duty cycle=190/360=52.77%
			//   3.if diff=-160,then 180-pidOut=180-(-160)=340,duty cycle=340/360=94.44%
			//   4.if diff=-180时,then 180-pidOut=180-(-180)=360,duty cycle=360/360=100% (anti-clockwise maximum speed)
			uCurrentEncoder = __HAL_TIM_GET_COUNTER(&htim5);
			fPIDOut = zsy_PIDCalculate(obj, obj->m_uTargetEncoder,
					uCurrentEncoder);
			if (fPIDOut > 180) {
				fPIDOut = 180;
			} else if (fPIDOut < -180) {
				fPIDOut = -180;
			}

			uPWMCtl = 180 - fPIDOut;
			__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, uPWMCtl);
		}

		osDelay(1);
	}
	/* USER CODE END ZPidTaskLoop */
}

/* USER CODE BEGIN Header_ZModBusTaskLoop */
/**
 * @brief Function implementing the ZModBusTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_ZModBusTaskLoop */
void ZModBusTaskLoop(void *argument) {
	/* USER CODE BEGIN ZModBusTaskLoop */
	/* Infinite loop */
	for (;;) {
		//do parse out UART1 ModBus protocol.
		if (g_FlagUart1GetNewData) {
			uint32_t i = 0;
			for (i = 0; i < g_Uart1DmaPollLength; i += 4) {
				uint32_t t0 = g_Uart1DmaPoll[i + 0];
				uint32_t t1 = g_Uart1DmaPoll[i + 1];
				uint32_t t2 = g_Uart1DmaPoll[i + 2];
				uint32_t t3 = g_Uart1DmaPoll[i + 3];
				uint32_t uRxData = (t0 << 24) | (t1 << 16) | (t2 << 8)
						| (t3 << 0);
				switch (modbusObj.m_fsm) {
				case UnPack_Sync_Filed:
					if (uRxData == 0x44454354) {
						modbusObj.m_flagEncrypt = 0;
						modbusObj.m_fsm = UnPack_Length_Field;
					}
					if (uRxData == 0x454E4354) {
						modbusObj.m_flagEncrypt = 1;
						modbusObj.m_fsm = UnPack_Length_Field;
					} else {
						//something wrong,bypass this int(4 bytes).
					}
					memcpy(modbusObj.m_crc32Buffer, (void*) &g_Uart1DmaPoll[i],
							sizeof(uint32_t));
					modbusObj.m_crc32BufferLen = sizeof(uRxData);
					break;
				case UnPack_Length_Field:
					//Sync(4)+Length(4)+Key(4)+Address(4)+Data(4)+Padding(0)+CRC32(4)
					//So Length=Key(4)+Address(4)+Data(4)+Padding(0)+CRC32(4)=16 at least.
					if (uRxData < 16) {
						modbusObj.m_fsm = UnPack_Sync_Filed;
					} else {
						modbusObj.m_length = uRxData;
						modbusObj.m_fsm = UnPack_Key_Field;
						memcpy(
								&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],
								(void*) &g_Uart1DmaPoll[i], sizeof(uint32_t));
						modbusObj.m_crc32BufferLen += sizeof(uRxData);
					}
					break;
				case UnPack_Key_Field:
					modbusObj.m_key = uRxData;
					modbusObj.m_fsm = UnPack_Address_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],
							(void*) &g_Uart1DmaPoll[i], sizeof(uint32_t));
					modbusObj.m_crc32BufferLen += sizeof(uRxData);
					break;
				case UnPack_Address_Field:
					modbusObj.m_address = uRxData;
					modbusObj.m_fsm = UnPack_Data_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],
							(void*) &g_Uart1DmaPoll[i], sizeof(uint32_t));
					modbusObj.m_crc32BufferLen += sizeof(uRxData);
					break;
				case UnPack_Data_Field:
					modbusObj.m_data = uRxData;
					modbusObj.m_fsm = UnPack_CRC32_Field;
					memcpy(&modbusObj.m_crc32Buffer[modbusObj.m_crc32BufferLen],
							(void*) &g_Uart1DmaPoll[i], sizeof(uint32_t));
					modbusObj.m_crc32BufferLen += sizeof(uRxData);
					break;
				case UnPack_CRC32_Field:
					modbusObj.m_crc32 = uRxData;
					modbusObj.m_fsm = UnPack_Sync_Filed;
					uint32_t uCalcCRC32 = g_CRC32JAMCRCCalculate(
							modbusObj.m_crc32Buffer,
							modbusObj.m_crc32BufferLen);
					if (modbusObj.m_crc32 == uCalcCRC32) {
						zsyParseModBusFrame(&modbusObj);
					}
					break;
				default:
					modbusObj.m_fsm = UnPack_Sync_Filed;
					break;
				}
			}

			g_Uart1DmaPollLength = 0;
			//reset flag.
			g_FlagUart1GetNewData = 0;
			HAL_UART_Receive_DMA(&huart1, g_Uart1DmaBuffer, CMD_LENGTH_MIN);
		}
		osDelay(10);
	}
	/* USER CODE END ZModBusTaskLoop */
}

/**
 * @brief  Period elapsed callback in non blocking mode
 * @note   This function is called  when TIM7 interrupt took place, inside
 * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
 * a global variable "uwTick" used as application time base.
 * @param  htim : TIM handle
 * @retval None
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	/* USER CODE BEGIN Callback 0 */

	/* USER CODE END Callback 0 */
	if (htim->Instance == TIM7) {
		HAL_IncTick();
	}
	/* USER CODE BEGIN Callback 1 */
	if (htim->Instance == TIM4) {
		HAL_GPIO_WritePin(SM_LeftRight_NSLEEP_GPIO_Port,
				SM_LeftRight_NSLEEP_Pin, GPIO_PIN_RESET);
		HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
	} else if (htim->Instance == TIM3) {
		HAL_GPIO_WritePin(SM_UpDown_NSLEEP_GPIO_Port, SM_UpDown_NSLEEP_Pin,
				GPIO_PIN_RESET);
		HAL_TIM_PWM_Stop(&htim8, TIM_CHANNEL_2);
	}
	/* USER CODE END Callback 1 */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{ 
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
